print("Черниш Аліна Андріївна\nКМ-93\nЛабораторна робота№1 \nВаріант 22"
" \nЗнаходження значення функції")
"""Дан прямокутник розміром 647 x 170.
Скільки квадратів зі стороною 30 можна вирізати з нього?"""
a=647//30
b=170//30
c=str(a*b)
print(c + " квадратів зі стороною 30 см можна вирізати з прямокутника 647 на 170 ")